#include <stdio.h>

void main(void)
{
	// "Hello" 출력. 역슬래쉬
	printf("%cHello%c\n", '"', '"');	// "Hello"
	printf("\"Hello\"\n");		// "Hello"

	printf("-------------------------------------------------------");
	printf("아스키코드값 : %d\n", 'A');
	printf("문자 : %c\n", 65);

	printf("-------------------------------------------------------");
	printf("[%8.2f]\n", 12.34);		// [   12.34]
	printf("[%8.3f]\n", 12.34);		// [  12.340]
	printf("[%5.3f]\n", 12.34);		// [12.340] : 자리수가 적은경우에 그냥 무시됨.
	printf("[%8.1f]\n", 12.34);		// [    12.3] : 소수점 둘째자리 반올림 해서 버림됨.
	printf("[%8.1f]\n", 12.36);		// [    12.4] : 소수점 둘째자리 반올림 해서 올림됨.

	printf("-------------------------------------------------------");
	printf("[%5d]\n", 123);		// [  123]
	printf("[%-5d]\n", 123);	// [123  ]
	printf("[%+5d]\n", 123);	// [ +123]
	printf("[%05d]\n", 123);	// [00123]
	printf("[%-05d]\n", 123);	// [123  ] : 00이 안나오는 이유?? 123이 만단위로 늘어나면서 숫자 자체가 바뀌기 때문에 출력 안함.
}