1. 답을 입력받아 구구단을 출력하는 코드를 작성하시오
2 - 9  : 5
* **5단 * **
5 * 1 = 5
5 * 2 = 10
...
5 * 9 = 45

2. 구구단 출력
* **2단 * **
2 * 1 = 2
2 * 2 = 4
...

* **3단 * **
3 * 1 = 3
...

9 * 9 = 81

3. 시작단과 종료단을 입력받아 구구단을 출력하시오
시작단 : 5
종료단 : 6

* **5단 * **
5 * 1 = 5
...
6 * 9 = 54


시작단 : 6
종료단 : 5

* **5단 * **
5 * 1 = 5
...
6 * 9 = 54

4. 한라인에 3단씩 구구단을 출력하시오(반복문의 개수 최대 3개만 사용가능)

for (int i = 2; i <= 9; )
{
}

2 * 1 = 2     3 * 1 = 3    4 * 1 = 4
2 * 2 = 4     3 * 2 = 6    4 * 2 = 8
...
2 * 9 = 18   3 * 9 = 27   4 * 9 = 36

5 * 1 = 5    6 * 1 = 6    7 * 1 = 7
...

8 * 1 = 8    9 * 1 = 9
...
8 * 9 = 72  9 * 9 = 81

5. 369 게임을 작성하시오.
10 ~50 사이의 정수를 입력 : 35

< 1 ~35 369게임 >
1
2
짝
4
5
짝
7
8
짝
뽀숑
11
12
짝
14
15
짝
17
18
짝
뽀뽀숑
21
22
짝
24
25
짝
27
28
짝
뽀뽀뽀숑
짝
짝
짝짝
짝
짝
